05-performance-testing/k6/jsonplaceholder-load-test/results/k6-summary.txt
     ✓ GET posts returns 200
     ✓ GET posts returns data
     ✓ GET single post returns 200
     ✓ GET single post contains id
     ✓ POST post returns 201
     ✓ POST post contains id

     checks.........................: 100.00% ✓ 1578      ✗ 0   
     data_received..................: 7.8 MB  251 kB/s
     data_sent......................: 104 kB  3.4 kB/s
     http_req_blocked...............: avg=335.98µs min=0s     med=0s      max=27.46ms  p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=48.46µs  min=0s     med=0s      max=4.83ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=51.56ms  min=5.63ms med=12.91ms max=343.93ms p(90)=121.26ms p(95)=124.66ms
       { expected_response:true }...: avg=51.56ms  min=5.63ms med=12.91ms max=343.93ms p(90)=121.26ms p(95)=124.66ms
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 789 
     http_req_receiving.............: avg=1.96ms   min=0s     med=0s      max=257.59ms p(90)=3.8ms    p(95)=6.4ms   
     http_req_sending...............: avg=24.34µs  min=0s     med=0s      max=1ms      p(90)=45.6µs   p(95)=109.83µs
     http_req_tls_handshaking.......: avg=280.95µs min=0s     med=0s      max=23.72ms  p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=49.57ms  min=5.5ms  med=10.32ms max=343.93ms p(90)=121.2ms  p(95)=124.56ms
     http_reqs......................: 789     25.433729/s
     iteration_duration.............: avg=1.15s    min=1.13s  med=1.14s   max=1.45s    p(90)=1.17s    p(95)=1.19s   
     iterations.....................: 263     8.47791/s
     vus............................: 2       min=2       max=10
     vus_max........................: 10      min=10      max=10